# M1L5 More EDA with Pandas 

This notebook will guide you through some essential data manipulation techniques using the Pandas library in Python. We'll be working with the Austin Animal Center Intakes dataset, which contains information about animals entering the Austin Animal Center.

### **Dataset:** [Austin Animal Center Intakes](https://catalog.data.gov/dataset/austin-animal-center-intakes) -- This is also in your data folder 

### **Objectives:**

 1.  Load and explore the dataset.
 2.  Use `groupby()` to aggregate data.
 3.  Create contingency tables using `crosstab()`.
 4.  Identify and handle duplicate entries.

## Step 1:  Import pandas and numpy

In [2]:
#Import packages 

import pandas as pd
import numpy as np

## Step 2:  Load in the data and save it as `df`

In [4]:
df = pd.read_csv("animalcenter.csv")

## Step 3:  Look at the data (can you think of some methods to do this)

In [5]:
df.describe()

,Animal ID,Name,DateTime,MonthYear,Found Location,Intake Type,Intake Condition,Animal Type,Sex upon Intake,Age upon Intake,Breed,Color
count,173812,123821,173812,173812,173812,173812,173812,173812,173811,173812,173812,173812
unique,156287,29774,119722,140,70183,6,20,5,5,55,3006,661
top,A721033,Luna,09/23/2016 12:00:00 PM,June 2015,Austin (TX),Stray,Normal,Dog,Intact Male,1 year,Domestic Shorthair Mix,Black/White
freq,33,761,64,2189,31541,119160,147141,94608,58996,28294,33665,17976

## Step 4:  Count up how many missing values exist in each column (you would need to chain two methods here -- one to check for missing values and the other to sum missing values up)

In [9]:
df.isna().sum()

Animal ID               0
Name                49991
DateTime                0
MonthYear               0
Found Location          0
Intake Type             0
Intake Condition        0
Animal Type             0
Sex upon Intake         1
Age upon Intake         0
Breed                   0
Color                   0
dtype: int64

## Step 5:  Count up the amount of animals by Animal Type

In [8]:
animal_counts = df['Animal Type'].count()
print(animal_counts)

173812

## Step 6:  Create a crosstab showing the count of animal types for each intake condition.

In [13]:
cross_table = pd.crosstab(df["Intake Condition"],df["Animal Type"])
print(cross_table)

Animal Type       Bird    Cat    Dog  Livestock  Other
Intake Condition
Aged                 0     77    445          0      3
Agonal               0      3      1          0      0
Behavior             0      8     73          0      0
Congenital           0      0      1          0      0
Feral                0    133     11          0      1
Injured            249   4339   5000          2   1215
Med Attn             0     27     60          0      0
Med Urgent           0     11     10          0      0
Medical              0    213    391          0     10
Neonatal             1   1467    476          1     26
Neurologic           0      5      6          0      2
Normal             603  57032  83773         28   5705
Nursing              0   2559   1214          0    105
Other                8    110    229          0      6
Panleuk              0      1      0          0      0
Parvo                0      0     11          0      0
Pregnant             0     41    129          0      0
Sick                17   3287   2756          3   1876
Space                0      4      0          0      0
Unknown              0      7     22          0     19

## Step 7:  Check for duplicate Animal IDs (pay close attention to the syntax here)

In [16]:
duplicate_ids = df["Animal ID"].duplicated().count()
print(duplicate_ids)

173812

## Practice Joining Data

### Scenario 1
You have customer data split into two different files (DataFrames),
and you want to combine them into a single DataFrame for analysis.

In [ ]:
# Run the cell without changes to create the two dataframes 

customers_part1_df = pd.DataFrame({'CustomerID': [101, 102, 103],
                                   'FirstName': ['Alice', 'Bob', 'Charlie'],
                                   'City': ['Anytown', 'Otherville', 'Smallburg']})

customers_part2_df = pd.DataFrame({'CustomerID': [104, 105, 106],
                                   'FirstName': ['David', 'Emily', 'Frank'],
                                   'City': ['Bigcity', 'Townsville', 'Villageton']})

### Scenario 1 Task:  Use `pd.concat()` to stack the two dataframes above (afterall they have the same columns)

In [20]:
all_customers_df = pd.concat([customers_part1_df,customers_part2_df], ignore_index=1)
all_customers_df

   CustomerID FirstName        City
0         101     Alice     Anytown
1         102       Bob  Otherville
2         103   Charlie   Smallburg
3         104     David     Bigcity
4         105     Emily  Townsville
5         106     Frank  Villageton

### Scenario 2

Combining customer details and loyalty points.

In [29]:
# Run the cell without changes to create the two dataframes 

customer_details_df = pd.DataFrame({'CustomerID': [101, 102, 103],
                                    'Name': ['Alice', 'Bob', 'Charlie'],
                                    'City': ['Anytown', 'Otherville', 'Smallburg']})

loyalty_points_df = pd.DataFrame({'CustomerID': [101, 102, 103],
                                  'Points': [100, 250, 50]})

### Scenario 2 Task :  Merge the DataFrames on CustomerID

In [28]:
merged_customer_df = pd.merge(customer_details_df,loyalty_points_df)
merged_customer_df

   CustomerID     Name        City  Points
0         101    Alice     Anytown     100
1         102      Bob  Otherville     250
2         103  Charlie   Smallburg      50